#1
# Запитуємо у користувача трицифрове число
number=int(input("Введіть трицифрове число: "))

# Отримуємо цифри числа
a = number // 100 # Перша цифра(сотні). Тому ділимо на 100 і беремо цілу частину
b = (number % 100) // 10 # Друга цифра(десятки). Тому беремо остачу від ділення на 100, а потім ділимо на 10
c = number % 10 # Третя цифра(одиниці). Беремо остачу від ділення на 10

# Формуємо нове число, розміщуючи цифри у зворотному порядку
reversed_number = c * 100 + b * 10 + a

# Виводимо отриманне число
print(f"Число у зворотному порядку {reversed_number}")

#2
# Запитуємо у користувача початкову ціну товару
initial_price = float(input("Введіть початкову ціну товару:"))

# Запитаємо розмір знижки у %
discount_percent = float(input("Введіть розмір знижки у %:"))

# Обчислюємо суму знижки

discount_amount = (initial_price * discount_percent) / 100 

# Обчислюємо фінальну ціну після знижки
final_price = initial_price - discount_amount

# Виводимо результати
print(f"Сума знижки: {round(discount_amount, 2)} грн")
print(f"Фінальна ціна після знижки: {round(final_price, 2)} грн")

#3
# Введення врожайності для кожного сорту пшениці
yield1 = float(input("Введіть врожайність першого сорту пшениці: "))
yield2 = float(input("Введіть врожайність другого сорту пшениці: "))
yield3 = float(input("Введіть врожайність третього сорту пшениці: "))

# Введення площі кожного поля в (га)
area1 = float(input("Введіть площу першого поля (га): "))
area2 = float(input("Введіть площу другого поля (га): "))
area3 = float(input("Введіть площу третього поля (га): "))

# Обчислимо врожай з кожного поля
harvest1 = yield1 * area1
harvest2 = yield2 * area2
harvest3 = yield3 * area3

# Обчислимо загальний врожай
total_harvest = harvest1 + harvest2 + harvest3

# Вивід результатів
print("\n Результати:")
print(f"З першого поля зібрали {round(harvest1, 2)}")
print(f"З другого поля зібрали {round(harvest2, 2)}")
print(f"З третього поля зібрали {round(harvest3, 2)}")
print(f"Загальний врожай з трьох полів {round(total_harvest, 2)}")
