// Pyklad 1
#include <iostream>
#include <conio.h>
#include <windows.h>
#include <math.h>
using namespace std;
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    // Оголошення констант та змінних:
    const double pi = 3.14159;   // оголошення константи pi
    double r;                    // радіус основи прямого кругового циліндра
    double h;                    // висота прямого кругового циліндра
    double sb;                   // площа бічної поверхні циліндра
    double sp;                   // площа повної поверхні циліндра
    double v;                    // об’єм циліндра

    // Ввід заданих величин:
    cout << "\n Введіть радіус основи циліндра: ";
    cin >> r;
    cout << "\n Введіть висоту циліндра: ";
    cin >> h;

    // Обчислення параметрів циліндра:
    sb = 2 * pi * r * h;
    sp = sb + 2 * pi * r * r;
    v = pi * r * r * h;

    // Друк результатів у вигляді таблиці:
    cout.precision(3);
    cout << "\n Вхідні величини та результати обчислень:";
    cout << "\n -----------------------------------------------------------";
    cout << "\n I Вхідні величини:  I";
    cout << "\n -----------------------------------------------------------";
    cout << "\n I Радіус основи циліндра = " << r << "  I";
    cout << "\n I Висота циліндра = " << h << "  I";
    cout << "\n -----------------------------------------------------------";
    cout << "\n I Результати обчислень:  I";
    cout << "\n -----------------------------------------------------------";
    cout << "\n I Бічна поверхня циліндра = " << sb << " I";
    cout << "\n I Повна поверхня циліндра = " << sp << " I";
    cout << "\n I Об’єм циліндра = " << v << " I";
    cout << "\n -----------------------------------------------------------\n";
    return 0;
}
// Pryklad 2
#include <iostream>
#include <iomanip>
#include <windows.h>
#include <conio.h>
#include <math.h>
using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    const double pi = 3.14159;

    double x, y, z, a1, a2, a3, a4, a5;
    double b1, b2, b3, b4, b5;

    // Ввід задачі
    cout << "Введіть значення трьох дійсних змінних:\n";
    cin >> x >> y >> z;

    // Обчислення виразу a
    a1 = (2 * cos(x - pi / 6)) / (0.5 + pow(sin(y), 2));
    a2 = 1 + pow(z, 2) / (3 + pow(z, 2) / 5);
    a3 = acos(-0.5);
    a4 = pow(x, y) + fabs(y + 2 * z);
    a5 = log10(2 + x * x + y * y + 1);

    // Обчислення виразу b
    b1 = exp(-3 * x * x + y / 3 - z);
    b2 = pow(tan(x), 2) + y / (3 * z + 2);
    b3 = 1 / (sin(pi / 2 - 2 * x) * sin(pi / 2 - 2 * x));
    b4 = pow(x, 3) + (y / 2);
    b5 = pow(3, x) / (y / 3);

    // Виведення результатів у вигляді таблиці
    cout << fixed << setprecision(3) << "\n Вхідні величини та результати обчислень:";

    cout << "\n _______________________________________________";
    cout << "\n | Вхідні величини:        | Результати обчислень: |";
    cout << "\n |-------------------------|-----------------------|";
    cout << "\n | x = " << x << "         | a1 = " << a1 << "   | b1 = " << b1 << " |";
    cout << "\n | y = " << y << "         | a2 = " << a2 << "   | b2 = " << b2 << " |";
    cout << "\n | z = " << z << "         | a3 = " << a3 << "   | b3 = " << b3 << " |";
    cout << "\n |                         | a4 = " << a4 << "   | b4 = " << b4 << " |";
    cout << "\n |                         | a5 = " << a5 << "   | b5 = " << b5 << " |";
    cout << "\n _______________________________________________\n";

    return 0;
}
